import Btn from "../base/Btn";

export default function Values() {
  return (
    <>
      <Value
        dir="row"
        name="تقرير التحليل الشامل"
        title="اكتشف امكانات اتخاذ القرارات المثلى باستخدام تقارير التحليل"
        des="اكتشف امكانات اتخاذ القرارات الصائبة باستخدام تقارير التحليل القابلة للتخصيص فى التطبيق, اعرض الارقام والرسوم البيانيه والبيانات التاريخيه لاكثر من 10 سنوات, قم بتعديل التقرير حسب تفضيلاتك باضافة او تعديل الرسوم البيانيه والارقام لاعداد التقرير بالشكل الذى تريده ليقدم لك تجربه تحليليه مخصصه لك شخصيا."
        illu="./illu/01.svg"
      />
      <Value
        dir="row-reverse"
        name="المقارنة"
        title="تمكن وتفوق باستخدام ميزة التحليل المقارن."
        des="اختر مجموعة من الشركات وحدد معايير لمقارنة ادائها, تتيح ايضا هذه الخدمة امكانيه سرد الاسهم وفرزها لاقتناص الفرص الاستثمارية التى تتوافق مع اهدافك."
        illu="./illu/02.svg"
      />
      <Value
        dir="row"
        name="بناء الاستراجية الاستثمارية"
        title="كون استراتيجية الاستثمار المثلى من خلال استبياننا المميز"
        des="قم بتحديد نمط شراءظبيع الاسهم الخاص بك وتوزيع محفظتك, وحدد الاستراتيجيه المثلى لأهدافك, ادمج استراتيجيتك بسهولة مع تقرير التحليل الشامل فى التطبيق لتحصل على نهجك الاستثمارى الشامل."
        illu="./illu/03.svg"
      />
      <Value
        dir="row-reverse"
        name="فحص صحة القرارات"
        title="قيم صحة قراراتك الاستثماريه وتوزيع محفظتك"
        des="قيم صحة قراراتك الاستثماريه وتوزيع محفظتك باستخدام الخدمة المخصصه التى يوفرها التطبيق, احصل على ملاحظات قيمه لتعديل استراتيجياتك وتحقيق اقصة استفادة من استثماراتك."
        illu="./illu/04.svg"
      />
      <Value
        dir="row"
        name="دورات تعليمية"
        title="دورات فديو شامله لتطوير مهاراتك الاستثماريه"
        des="انطلق فى رحلة تطوير لمهاراتك الاستثماريه مع دورتنا الشامله عبر الفديو, ابدأ من الصفر واكتسب المفاهيم الاساسيه لسوق الاسهم, ابنى معرفتك ومهاراتك وخبرتك تدريجيا مع دوراتنا لكى تكون لديك القدره على اتخاذ افضل القرارات الاستثماريه."
        illu="./illu/05.svg"
      />
      <Value
        dir="row-reverse"
        name="المقالات"
        title="تابع المعلومات والمستجدات اول باول"
        des="كن على اطلاع على احدث المعلومات مع مجموعتنا المتنوعة من الاخبار والمقالات, تعرف على اراء الخبراء حول الاقتصاد واسواق الاسهم والاستثمار وتحليل السوق وغيرها."
        illu="./illu/06.svg"
      />
    </>
  );
}

function Value({ dir, illu, title, des, name }) {
  return (
    <section className="value" style={{ flexDirection: dir }}>
      <div className="content">
        <div className="text">
          <div className="head">
            <span>{name}</span>
            <h2>{title}</h2>
          </div>
          <p>{des}</p>
        </div>
        <Btn
          text="ابدأ الان"
          icon="./icons/arrowLeftDark.svg"
          link="#"
          type="s"
          size="m"
        />
      </div>
      <img className="illu" src={illu} alt={name} />
    </section>
  );
}
