const serviceData = [
  {
    id: 1,
    iconURL: "./icons/money.svg",
    title: "الاشارات المالية",
    des: "تلقى تحديثات منتظمة عن الاسهم التى تهمك واستفد من التحليلات لتتخذ قراراتك فى الوقت المناسب وبناء على معلومات وتحليل موثوق.",
  },
  {
    id: 2,
    iconURL: "./icons/wallet.svg",
    title: "المحفظه الافتراضيه",
    des: "لا تفضل تجربة الاستثمار بمالك الحقيقى؟ لدينا المحفظه الافتراضيه التى تسمح لك بتجربة استراتيجيات مختلفة دون ان تخسر  اموالك, تعلم من اخطائك واختبر افكارك الجديده بكل اطمئنان.",
  },
  {
    id: 3,
    iconURL: "./icons/chat.svg",
    title: "الدعم الفنى",
    des: "عند مواجهة اى مشكلة او عند وجود اى استفسارات فريق الدعم الفنى المتخصص لدينا جاهز لمساعدتك سواء كنت تحتاج الى مساعدة فى استخدام التطبيق او شرح لميزات معينة, ما عليك الا التواصل معنا.",
  },
  {
    id: 4,
    iconURL: "./icons/updates.svg",
    title: "تحديثات مستمرة",
    des: "نحرص على تطوير التطبيق باستمرار وتقديم تحديثات جديدة ومحسنة, نستمع لملاحظات المستخدمين ونعمل على تلبية احتياجاتهم, فريق التطوير لدينا دئما على استعداد لتحسين تجربتك وتقديم خدمة افضل.",
  },
  {
    id: 5,
    iconURL: "./icons/devices.svg",
    title: "التوفر على مختلف الاجهزه",
    des: "تطبيقنا متاح على مختلف الاجهزة سواء كنت تستخدم هاتف ذكى او جهاز لوحى او حاسب مكتبى, بهذة الطريقة تستطيع ان تستمتع بتجربة التطبيق فى اى وقت ومن اى مكان يناسبك.",
  },
];

export default serviceData;
